uni/informatik/planner.org
#+OPTIONS: toc:nil
#+SETUPFILE: ~/.emacs.d/org-html-themes/setup/theme-bigblow.setup
* Misc
- [[https://www.tu-chemnitz.de/verwaltung/studentenamt/abt11/ordnungen/2011/2011/18-2011/AB_182011_2.pdf][Prüfungsordnung]]
- [[https://www.tu-chemnitz.de/verwaltung/studentenamt/abt11/ordnungen/2011/2011/18-2011/AB_182011_1.pdf][Studienordnung]]
- [[https://www.tu-chemnitz.de/studentenservice/zsb/start/start2018.pdf][Infos fuer Studienanfänger]]
- 120 ETCS insgesamt benötigt
- "Ein Fernstudium ist nicht vorgesehen. Der Studiengang kann bei Berufstätigkeit oder besonderen familiären Verpflichtungen in Teilzeit studiert werden. Im Teilzeitstudium beträgt der durchschnittliche Arbeitsaufwand pro Semester 50 % des Vollzeitstudiums. Die Wochenarbeitszeit der Berufstätigkeit muss mindestens 18 Stunden betragen."
* Pflichtmodule
** Basismodule
- 29 ETCS benötigt
| Titel                         | Credits |
|-------------------------------+---------|
| Algorithmen & Datenstrukturen |      16 |
| Proseminar Informatik         |       3 |
| Grundlagen Informatik I       |       5 |
| Grundlagen Informatik II      |       5 |
** Andere
- 50 ETCS benötigt
| Titel                        | Credits |
|------------------------------+---------|
| Forschungsseminar Informatik |       5 |
| Forschungspraktikum          |      15 |
| Masterarbeit                 |      30 |

* Wahlmodule
- 41 ETCS benötigt

| Titel                                      | Credits |
|--------------------------------------------+---------|
| Mathe I                                    |       9 |
| Mathe II                                   |       9 |
| Rechnerorganisation                        |       5 |
| Entwurf verteilter Systeme                 |       5 |
| Rechnernetze                               |       5 |
| Sicherheit Verteilter Systeme              |       5 |
| XML-Werkzeuge                              |       5 |
| Grundlagen der Technischen Informatik      |       8 |
| Techniken der IT-Sicherheit                |       5 |
| Industrielle IT-Anwendungen der Informatik |       2 |
| Datenbanken Grundlagen                     |       5 |
| Datenbanken und Webtechniken               |       5 |
| Datenbanken und Objektorientierung         |       5 |
| Grundlagen der Anwedungsunterstützung      |       5 |
| Betriebssysteme                            |       5 |
| Computergraphik I                          |       5 |
| Grundlagen der Computergeometrie           |       5 |
| Einführung in praktische Computergraphik   |       5 |
| Bilderverstehen                            |       5 |
| Einführung in Künstliche Intelligenz       |       5 |
| Maschinelles Lernen                        |       5 |
| Neurokognition I                           |       5 |
| Neurokognition II                          |       5 |
| Sprachverstehen                            |       5 |
| Medienapplikationen                        |       5 |
| Mediencodierung                            |       5 |
| Medienergonomie                            |       5 |
| Mediengestaltung                           |       5 |
| Medienmanagement                           |       5 |
| Medienprogrammierung                       |       5 |
| Medienretrieval                            |       5 |
| Medientools                                |       3 |
* Modulplanung
** Studienablaufplan
*** Solution Plan
Der finale Plan der verfolgt wird
|    | WiSe 18                                    | SoSe 19                                  | WiSe 19                          | SoSe 20      |
|----+--------------------------------------------+------------------------------------------+----------------------------------+--------------|
| BM | Algorithmen                                | Datenstrukturen                          | Forschungsseminar                | Masterarbeit |
| BM | Informatik I                               | Informatik II                            | Forschungspraktikum              |              |
| BM |                                            | Proseminar Informatik                    |                                  |              |
|    |                                            |                                          |                                  |              |
| WM | Entwurf Verteilter Systeme                 | Rechnernetze                             |                                  |              |
| WM |                                            | Einführung Künstliche Intelligenz [Opt1] | Maschinelles Lernen[Opt1]        |              |
| WM | Datenbanken Grundlagen                     | Datenbanken & Webtechniken               | Datenbanken & Objektorientierung |              |
| WM | Industrielle IT-Anwendungen der Informatik | Betriebssysteme                          |                                  |              |

* Stundenpläne
** WiSe 18/19 (required)
| Time          | Mo                  | Di                              | Mi                        | Do                  | Fr                |
|---------------+---------------------+---------------------------------+---------------------------+---------------------+-------------------|
| 07:30 - 09:00 |                     |                                 |                           |                     | Informatik I [VL] |
| 09:15 - 10:45 | Datenbanken [Übung] |                                 |                           |                     |                   |
| 11:30 - 13:00 | Algo & Prog [VL]    |                                 | Informatik I[Übung/Prakt] |                     | Algo & Prog [VL]  |
| 13:45 - 15:15 |                     | Verteilte Systeme [VL ab 13:30] |                           |                     |                   |
| 15:30 - 17:00 |                     |                                 |                           | Algo & Prog [Übung] |                   |
| 17:15 - 18:45 |                     |                                 | Verteilte Systeme [Übung] |                     |                   |

** WiSe 18/19 ("alle" Veranstaltungen)
| Time          | Mo               | Di                               | Mi                                           | Do                                      | Fr                  |
|---------------+------------------+----------------------------------+----------------------------------------------+-----------------------------------------+---------------------|
| 07:30 - 09:00 |                  |                                  |                                              |                                         | Informatik I [VL]   |
| 09:15 - 10:45 |                  |                                  |                                              |                                         |                     |
| 11:30 - 13:00 | Algo & Prog [VL] |                                  | Informatik I[Übung/Prakt](+Datenbanken [VL]) |                                         | Algo & Prog [VL]    |
| 13:45 - 15:15 |                  | Verteile Systeme [VL ab 13:30]   |                                              |                                         | Algo & Prog [Übung] |
| 15:30 - 17:00 |                  |                                  | (Algo & Prog [Q&A])                          | Algo & Prog [Übung]/IT-Anwendungen [VL] |                     |
| 17:15 - 18:45 |                  | (Algo & Prog [begleitetes Prog]) | Verteilte Systeme [Übung]                    |                                         |                     |

# | Veranstaltung | Zeitraum VL                                 | Zeitraum Übung                                 | Zeitraum Tut                                   | Zeitraum Andere                                |
# |---------------+---------------------------------------------+------------------------------------------------+------------------------------------------------+------------------------------------------------|
# | Algorithmen   | Montag[11:30-13:00] \\ Freitag[11:30-13:00] | Donnerstag[15:30-17:00]                        | Mittwoch[15:30-17:00] \\ Dienstag[17:15-18:45] |                                                |
# | Informatik I  | Freitag[07:30-09:00]                        | Dienstag[13:45-15:15] \\ Mittwoch[11:30-13:00] |                                                | Dienstag[13:45-15:15] \\ Mittwoch[11:30-13:00] |
# | Verteilte Sys | Dienstag[13:30-15:00]                       | Freitag[07:30-09:00] \\ Mittwoch[17:15-18:45]  |                                                |                                                |
# | Datenbanken   | Mittwoch[11:30-13:00]                       | Mittwoch[13:45-15:15]                          |                                                |                                                |
# | Industrielle  | Donnerstag[15:30-17:00]                     |                                                |                                                |                                                |


# Info 1 Prakt Andere: 
